package it.macgood.mathanappkt.ui.guidebook.encyclopedia

object EncyclopediaData {
    @JvmStatic
    val termsList = listOf<Term>(
        Term("Аппроксимация", " научный метод, состоящий в замене одних объектов другими, в каком-то смысле близкими к исходным, но более простыми."),
        Term("Бином Ньютона", "формула, определяющая разложение бинома в степени n."),
        Term("Вектор (векторная функция)", "математический объект, имеющий длину (модуль) и направление."),
        Term("Граница функции", "концепция, связанная с пределом функции, определяющая поведение функции вблизи точки"),
        Term("Дифференциал", "Свойство ряда, при котором сходимость не зависит от порядка слагаемых."),
        Term("Евклидово пространство", "векторное пространство, обладающее дополнительной структурой, заданной скалярным произведением."),
        Term("Жорданова измеримость", "концепция, связанная с измеримостью множества на числовой прямой или в n-мерном пространстве."),
        Term("Замкнутое множество", "Свойство ряда, при котором сходимость не зависит от порядка слагаемых."),
        Term("Интеграл", "математический объект, обобщающий суммирование и позволяющий вычислять площади, объёмы, центры тяжести и другие величины."),
        Term("Композиция функций", "операция, при которой одна функция применяется к результату другой функции."),
        Term("Логарифм", " математическая функция, обратная к экспоненциальной функции."),
        Term("Монотонная функция", "функция, которая сохраняет порядок между элементами своей области определения."),
        Term("Непрерывность ", "свойство функции, при котором она сохраняет значения при малых изменениях аргумента."),
        Term("Определитель ", "Свойство ряда, при котором сходимость не зависит от порядка слагаемых."),
        Term("Производная ", "концепция, определяющая скорость изменения функции в каждой точке её области определения."),
        Term("Ряд Тейлора", "это представление функции в виде бесконечной суммы её производных в точке разделённых на соответствующие факториалы и умноженных на степени разности аргумента и точки разложения."),
        Term("Сходимость ", "свойство последовательности или ряда, при котором он стремится к некоторому пределу."),
        Term("Точка разрыва ", "точка, в которой функция не является непрерывной."),
        Term("Условная сходимость", "свойство ряда, при котором его сходимость зависит от порядка слагаемых."),
        Term("Функция ", "математический объект, который сопоставляет каждому элементу из одного множества другой элемент."),
        Term("Хаос ", "математическое понятие, связанное с непредсказуемостью и чувствительностью к начальным условиям в динамических системах."),
        Term("Число Эйлера", "математическая константа, обозначаемая буквой \"e\", равная примерно 2.71828."),
        Term("Шаровая мера", "мера объема или площади, определенная на шаровых областях в пространстве."),
        Term("Экстремум ", "точка, в которой функция принимает наибольшее или наименьшее значение."),
        Term("Юнг, Карл Густав", " немецкий математик, внёсший вклад в теорию функций, теорию чисел и механику."),
        Term("Якобиан ", "определитель матрицы, составленной из частных производных системы функций.")

    )
}