package it.macgood.mathanappkt.ui.handbook.demidovich

object Chapters {

    val chapters = listOf(
        Chapter(
            1,
            "Глава I",
            "Введение в анализ",
            "Страницы: 9 - 39",
            "Задачи: 1 - 340",
            IntRange(1, 340)
        ),
        Chapter(
            2,
            "Глава II",
            "Дифферинцирование функции",
            "Страницы: 40 - 79",
            "Задачи: 341 - 810",
            IntRange(341, 810)
        ),
        Chapter(
            3,
            "Глава III",
            "Экстремумы функции и геометрические приложения производной",
            "Страницы: 80 - 101",
            "Задачи: 811 - 1030",
            IntRange(811, 1030)
        ),
        Chapter(
            4,
            "Глава IV",
            "Неопределённый интеграл",
            "Страницы: 102 - 132",
            "Задачи: 1031 - 1500",
            IntRange(1031, 1500)
        ),
        Chapter(
            5,
            "Глава V",
            "Определённый интеграл",
            "Страницы: 133 - 171",
            "Задачи: 1501 - 1781",
            IntRange(1501, 1781)
        ),
        Chapter(
            6,
            "Глава VI",
            "Функции нескольких переменных",
            "Страницы: 172 - 232",
            "Задачи: 1782 - 2112",
            IntRange(1782, 2112)
        ),
        Chapter(
            7,
            "Глава VII",
            "Кратные и криволинейные интегралы",
            "Страницы: 233 - 276",
            "Задачи: 2113 - 2400",
            IntRange(2113, 2400)
        ),
        Chapter(
            8,
            "Глава VIII",
            "Ряды",
            "Страницы: 277 - 305",
            "Задачи: 2401 - 2703",
            IntRange(2401, 2703)
        ),
        Chapter(
            9,
            "Глава IX",
            "Дифференциальные уравнения",
            "Страницы: 306 - 349",
            "Задачи: 2704 - 3107",
            IntRange(2704, 3107)
        ),
        Chapter(
            10,
            "Глава X",
            "Приближенные вычисления",
            "Страницы: 350 - 377",
            "Задачи: 3108 - 3193",
            IntRange(3108, 3193)
        )
    )
}